# Your code here!
# -*- coding : utf -8 -*-
###############################################################################
##
## sdeng 簡易伝言板クライアント()
##
###############################################################################
require "etc"
require "socket"
require "timeout"
require "thread"
port = 40000 # 伝言板サービスは 40000 番ポート
host = ARGV[0] # コマンドライン引数をホスト名に
host = "10.0.2.15" if (host == nil)
# host == nil なら自分のホスト名
#timeout(5) {$sock = TCPSocket::open(host,port)} # サーバへ $sock を接続
$sock = TCPSocket::open(host,port)
$sock.puts(Etc::getlogin()) # login 名をサーバへ送る
###############################################################################
## ユーザ入力/ソケット送信処理
###############################################################################
Thread::start() do
    ## ユーザ入力/ソケット送信を別スレッドで実行し、
    ## ソケット受信/コンソール表示は以下で続行
    while(line = $stdin.gets())
        $sock.puts(line)
    end
    exit(0) # ユーザ入力が閉じられたら全スレッド終了
end
###############################################################################
## ソケット受信/コンソール表示処理
###############################################################################
while(line = $sock.gets())
    puts(" > " + line) # サーバからのテキストの前には ’> ’ を付ける
end
exit(0) # ソケットが閉じられたら全スレッド終了
###############################################################################

